ambitions_app/app/views/users/show.html.erb

SELECT COUNT(*) FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]
---
<%# comment form %>
<% if @user.goals.count > 0 %>
<%= @user.username %>'s <%= @user.goals.count %> Goals: