ambitions_app/app/controllers/goals_controller.rb

INSERT INTO "goals" ("title", "details", "private", "completed", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @goal = Goal.find(params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @goal = Goal.find(params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "goals" SET "details" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["details", "I really need to pass this exam to feel good about the rest of the cohort.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"], ["updated_at", "2022-07-07 20:48:49.585517"], ["id", 4]]
---
  def update
    @goal = Goal.find(params[:id])
    if @goal.update(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 1]]
---
  def destroy
    @goal = Goal.find(params[:id])
    if @goal && @goal.destroy