ambitions_app/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "testing"], ["password_digest", "$2a$12$FGaXRsaxQO.tjFd/TTtBOesCwPsK4p4kDtPWfTnZVpWghW6rZLp92"], ["session_token", "lhem7to-JKhAq09a_Rk2Zw"]]
---
 def create
  @user = User.new(user_params)
  if @user.save